[{"note_id":39499,"note_title":"add","project_id":3,"note_date":"2025-01-01","note":"\t"},{"note_id":61111,"note_title":"förtsätt med delet functionn","project_id":3,"note_date":"2025-01-01","note":"jag behöver jobba mer med att göra klar delete function."},{"note_id":21379,"note_title":"edit fuction","project_id":3,"note_date":"2025-01-01","note":"edit project function är inte klar. jag måsste jobba med."},{"note_id":91210,"note_title":"kan inte ta bort","project_id":3,"note_date":"2025-01-01","note":"jag kan inte ta bort en project."},{"note_id":91583,"note_title":"Den 2 dec","project_id":90,"note_date":"2025-01-01","note":" fick vi uppdrag att bestämma oss om vilken databaser vi ska använda och då jag och min grupp bestämde oss att ses på Whatsapp och diskutera vilken databaser vi vill använda och vi kom fram till att SQL passar oss bra i detta projekt. "},{"note_id":28835,"note_title":"Den 3 dec","project_id":90,"note_date":"2025-01-01","note":" ses vi också på Whatsapp som vi bestämde oss att använda för kommunikation då diskuterade vi vad för app. vi vill skapa och hur vi ska skapa och vilken roller vi ska ha."},{"note_id":64488,"note_title":"den 4 de","project_id":90,"note_date":"2025-01-01","note":" vi jobbade med userStory och vi hade tagit fram några stories."},{"note_id":52103,"note_title":"Den 6 dec","project_id":90,"note_date":"2025-01-01","note":" uppdaterar vi userStoreies."},{"note_id":22814,"note_title":"Den 9 dec","project_id":90,"note_date":"2025-01-01","note":"jag jobbar med att uppdatera userStories. Jag lägger till kolumner\nobject: status\noch jag jobbar med att planera for relationer på draw.io\n \t"},{"note_id":79476,"note_title":"Den 11 december","project_id":90,"note_date":"2025-01-01","note":"jag förtsätter att rita och planer för database. \nskriver koden  för database men inte testat det\nlagt till nedstående tabellerna:\ncategory, object_category, detail, object_details, servce, booking_service.\n"},{"note_id":41950,"note_title":"Den 12 dec","project_id":90,"note_date":"2025-01-01","note":"jag jobbar med att rätta och excuter  queries som skapar tabeller och relationer mellan olika tabeller. Dt finns flera olika typ av database relationer one-one, one- meny- meny-meny. jag möter mina grupp kollegor och de år veta på vad jag jobbar med och de hjälper med och vi ska mötas på teams på lördag för att diskutera vad ska berätta för Helena på måndag"},{"note_id":13533,"note_title":"Den 13 dec","project_id":90,"note_date":"2025-01-01","note":"jag gör klar alla tabeller som jag förväntar att hantera olika funktioner. Jag testar olika queries och hur de kommer att beta sig."},{"note_id":90020,"note_title":"Den 16 dec","project_id":90,"note_date":"2025-01-01","note":"idag träffar vi och diskuterar databasen och vi ändrar några tabellerna. Sedan vi provar om alla queries fungerar på det sätt vi förväntas. vi ska testa och testa igen fler och fler querises för att kolla upp om det stämmer."},{"note_id":87231,"note_title":"Den 27","project_id":90,"note_date":"2025-01-01","note":"vi träffar Helena idag och hon rekommenderar oss att göra vissa ändringar för att förbättra daatabasen. Mötet tog mer än 50 minuter och det var mycket viktigt för oss."},{"note_id":8007,"note_title":"Den 28 dec","project_id":90,"note_date":"2025-01-01","note":"jag testar databasen om det funkar som det ska. Det behövs ännu mer jusetering. Dessuton jag glömmer kolumners namn."},{"note_id":75586,"note_title":"tedsr","project_id":44,"note_date":"2025-01-01","note":"§§"},{"note_id":84455,"note_title":"extra tid","project_id":90,"note_date":"2025-01-02","note":"jag och mohammaed frågade Helena om vi  kunde få extra tid för vår presentation.  Hon gick med på detta och gav oss 10 dagar extra:\n"}]